-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:8889
-- Generation Time: Feb 22, 2025 at 09:31 AM
-- Server version: 8.0.40
-- PHP Version: 8.3.14

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `a_shabu`
--

-- --------------------------------------------------------

--
-- Table structure for table `category`
--

CREATE TABLE `category` (
  `category_id` int NOT NULL,
  `category_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `category`
--

INSERT INTO `category` (`category_id`, `category_name`, `description`) VALUES
(1101, 'ผัก', ''),
(1102, 'เนื้อสัตว์', ''),
(1103, 'อาหารแปรรูป', ''),
(1104, 'อาหารทะเล', ''),
(1105, 'อื่นๆ', ''),
(1106, 'น้ำซุป', ''),
(1107, 'ผลไม้', ''),
(1108, 'น้ำจิ้ม', '');

-- --------------------------------------------------------

--
-- Table structure for table `employee`
--

CREATE TABLE `employee` (
  `employee_id` int NOT NULL,
  `first_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `role_id` int NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `employee`
--

INSERT INTO `employee` (`employee_id`, `first_name`, `last_name`, `email`, `phone`, `role_id`, `created_at`) VALUES
(1, 'ใจดี', 'เมตตา', 'jaidee@gmail.com', '090-0009000', 206, '2025-02-04 15:26:36'),
(2, 'ใจยักษ์', 'ใจมาร', 'jaiyuk@gmail.com', '090-0000000', 202, '2025-02-10 15:30:58');

-- --------------------------------------------------------

--
-- Table structure for table `getting_table`
--

CREATE TABLE `getting_table` (
  `getting_table_id` int NOT NULL,
  `walkin_id` int DEFAULT NULL,
  `reservation_id` int DEFAULT NULL,
  `employee_id` int NOT NULL,
  `package_id` int NOT NULL,
  `promotion_id` int DEFAULT NULL,
  `total_amount` decimal(10,0) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `getting_table`
--

INSERT INTO `getting_table` (`getting_table_id`, `walkin_id`, `reservation_id`, `employee_id`, `package_id`, `promotion_id`, `total_amount`, `created_at`) VALUES
(811639, NULL, 776787, 1, 702, NULL, 8299, '2025-02-22 07:46:52');

-- --------------------------------------------------------

--
-- Table structure for table `member`
--

CREATE TABLE `member` (
  `member_id` int NOT NULL,
  `first_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `gender` enum('Female','Male') COLLATE utf8mb4_unicode_ci NOT NULL,
  `religion` enum('Buddhism','Islam') COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password_hash` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `birth_day` date NOT NULL,
  `phone` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `signup_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `member`
--

INSERT INTO `member` (`member_id`, `first_name`, `last_name`, `gender`, `religion`, `email`, `password_hash`, `birth_day`, `phone`, `signup_date`) VALUES
(1501, 'ดาวเรือง', 'พรศักดิ์ส่องแสง', 'Female', 'Buddhism', 'win01@email.com', '123456', '0000-00-00', '0931234567', '2025-02-10 17:30:31'),
(1502, 'ชบา', 'ชื่นชม', 'Female', 'Islam', 'ploy22@email.com', 'abc123', '0000-00-00', '0822345678', '2025-02-10 17:30:43'),
(1503, 'สมชาย', 'ไกรศักด์', 'Male', 'Islam', 'mint33@email.com', '456789', '0000-00-00', '0633456789', '2025-02-10 17:30:50'),
(1504, 'ชมพู', 'ฟ้า', 'Female', 'Islam', 'jay44@email.com', 'qwerty', '0000-00-00', '0944567890', '2025-02-10 17:30:58'),
(1505, 'วินัย', 'ทองโต', 'Male', 'Buddhism', 'nam55@email.com', 'zxcvbn', '0000-00-00', '0955678901', '2025-02-10 17:31:06'),
(1506, 'ดวงดาว', 'สพันจ์', 'Female', 'Islam', 'phoom66@email.com', '987654', '0000-00-00', '0866789012', '2025-02-10 17:31:13'),
(1507, 'สมหมาย', 'สุดหล่อ', 'Male', 'Buddhism', 'krit77@email.com', 'asdfgh', '0000-00-00', '0817890123', '2025-02-10 17:31:23'),
(1508, 'สมปอง', 'ทองสุก', 'Male', 'Islam', 'noon88@email.com', 'noon88', '0000-00-00', '0928901234', '2025-02-10 17:31:29'),
(1509, 'สมหญิง', 'สุดสวย', 'Female', 'Buddhism', 'max99@email.com', '112233', '0000-00-00', '0939012345', '2025-02-10 17:31:37'),
(1510, 'เดือนเหนือ', 'เตโชกิจ', 'Male', 'Islam', 'pat11@email.com', 'hello1', '0000-00-00', '0640123456', '2025-02-10 17:31:43'),
(1511, 'Donul', 'Trump', 'Male', 'Islam', 'ice22@email.com', 'loveu2', '0000-00-00', '0851236789', '2025-02-10 17:31:52'),
(1512, 'Ronado', 'Stampt', 'Male', 'Islam', 'ton33@email.com', 'test123', '0000-00-00', '0962347890', '2025-02-10 17:32:00'),
(1513, 'นาตารี', 'ดีงาม', 'Female', 'Buddhism', 'bell44@email.com', 'easy123', '0000-00-00', '0883458901', '2025-02-10 17:32:07'),
(1514, 'Daren', 'Smith', 'Female', 'Islam', 'zen55@email.com', 'mypass', '0000-00-00', '0894569012', '2025-02-10 17:32:15'),
(1515, 'Jeremy', 'Carck', 'Male', 'Buddhism', 'art66@email.com', '123abc', '0000-00-00', '0805670231', '2025-02-10 17:32:21');

-- --------------------------------------------------------

--
-- Table structure for table `menu`
--

CREATE TABLE `menu` (
  `menu_id` int NOT NULL,
  `raw_material_id` int NOT NULL,
  `quantity_of_sale` int NOT NULL,
  `unit` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `menu`
--

INSERT INTO `menu` (`menu_id`, `raw_material_id`, `quantity_of_sale`, `unit`) VALUES
(101, 1, 200, 'g.'),
(102, 2, 200, 'g.'),
(103, 3, 200, 'g.'),
(104, 4, 200, 'g.'),
(105, 5, 200, 'g.'),
(106, 6, 200, 'g.'),
(107, 7, 200, 'g.'),
(108, 8, 100, 'g.'),
(109, 9, 200, 'g.'),
(110, 10, 200, 'g.'),
(111, 11, 200, 'g.'),
(112, 12, 200, 'g.'),
(113, 13, 200, 'g.'),
(114, 14, 200, 'g.'),
(115, 15, 200, 'g.'),
(116, 16, 200, 'g.'),
(117, 17, 200, 'g.'),
(118, 18, 100, 'g.'),
(119, 19, 200, 'g.'),
(120, 20, 200, 'g.'),
(121, 21, 200, 'g.'),
(122, 22, 148, 'g.'),
(123, 23, 148, 'g.'),
(124, 24, 148, 'g.'),
(125, 25, 139, 'g.'),
(126, 26, 80, 'g.'),
(127, 27, 90, 'g.'),
(128, 28, 200, 'g.'),
(129, 29, 59, 'g.'),
(130, 30, 80, 'g.'),
(131, 31, 80, 'g.'),
(132, 32, 200, 'g.'),
(133, 33, 60, 'g.'),
(134, 34, 200, 'ml'),
(135, 35, 500, 'ml'),
(136, 36, 500, 'ml'),
(137, 37, 500, 'ml'),
(138, 38, 500, 'ml'),
(139, 39, 500, 'ml'),
(140, 40, 500, 'ml'),
(141, 41, 500, 'ml'),
(142, 42, 60, 'g.'),
(143, 43, 60, 'g.'),
(144, 44, 60, 'g.'),
(145, 45, 60, 'g.'),
(146, 46, 200, 'g.'),
(147, 47, 200, 'g.'),
(148, 48, 200, 'g.'),
(149, 49, 200, 'g.'),
(150, 50, 200, 'g.'),
(151, 51, 200, 'g.'),
(152, 52, 200, 'g.'),
(153, 53, 200, 'g.'),
(154, 54, 200, 'g.'),
(155, 55, 100, 'g.'),
(156, 56, 100, 'g.'),
(157, 57, 100, 'g.'),
(158, 58, 100, 'g.'),
(159, 59, 100, 'g.'),
(160, 60, 100, 'g.'),
(161, 61, 100, 'g.'),
(162, 62, 100, 'g.'),
(163, 63, 100, 'g.'),
(164, 64, 100, 'g.'),
(165, 65, 100, 'g.'),
(167, 67, 100, 'g.'),
(168, 68, 100, 'g.'),
(169, 69, 100, ''),
(170, 70, 100, 'g.'),
(171, 71, 100, 'g.'),
(172, 72, 100, 'g.'),
(173, 73, 600, 'ml'),
(174, 74, 600, 'ml'),
(175, 75, 600, 'ml'),
(176, 76, 45, 'ml'),
(177, 77, 45, 'ml'),
(178, 78, 45, 'ml'),
(179, 79, 15, 'g.'),
(180, 80, 15, 'g.'),
(181, 81, 30, 'ml');

-- --------------------------------------------------------

--
-- Table structure for table `notification`
--

CREATE TABLE `notification` (
  `Notification` int NOT NULL,
  `Notification_name` int NOT NULL,
  `status` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `notification_order`
--

CREATE TABLE `notification_order` (
  `notifine_order_id` int NOT NULL,
  `select_item_id` int NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `order`
--

CREATE TABLE `order` (
  `order_id` int NOT NULL,
  `select_menu_id` int NOT NULL,
  `order_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `status` enum('in_progress','complete','','') COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `package`
--

CREATE TABLE `package` (
  `package_id` int NOT NULL,
  `package_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `package`
--

INSERT INTO `package` (`package_id`, `package_name`, `price`) VALUES
(701, 'แพ็กเกจหมู', 899),
(702, 'แพ็กเกจเนื้อ', 8299),
(703, 'แพ็กเกจทะเล', 1299),
(704, 'แพ็กเกจมังสวิรัติ', 699),
(705, 'แพ็กเกจรวม', 8599);

-- --------------------------------------------------------

--
-- Table structure for table `package_item`
--

CREATE TABLE `package_item` (
  `package_item_id` int NOT NULL,
  `package_id` int NOT NULL,
  `menu_id` int NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `package_item`
--

INSERT INTO `package_item` (`package_item_id`, `package_id`, `menu_id`, `description`, `created_at`) VALUES
(1401, 701, 101, '', '2025-02-20 16:04:59'),
(1402, 701, 102, '', '2025-02-20 16:05:07'),
(1403, 701, 103, '', '2025-02-20 16:06:16'),
(1404, 701, 104, '', '2025-02-20 16:06:24'),
(1405, 701, 105, '', '2025-02-20 16:06:32'),
(1406, 701, 106, '', '2025-02-20 16:06:38'),
(1407, 701, 107, '', '2025-02-20 16:06:47'),
(1408, 701, 108, '', '2025-02-20 16:07:15'),
(1409, 701, 109, '', '2025-02-20 16:07:23'),
(1410, 701, 110, '', '2025-02-20 16:07:30'),
(1411, 701, 111, '', '2025-02-20 16:07:38'),
(1412, 701, 112, '', '2025-02-20 16:07:44'),
(1413, 701, 113, '', '2025-02-20 16:07:55'),
(1414, 701, 114, '', '2025-02-20 16:08:07'),
(1415, 701, 115, '', '2025-02-20 16:08:14'),
(1416, 701, 116, '', '2025-02-20 16:08:34'),
(1417, 701, 117, '', '2025-02-20 16:08:42'),
(1418, 701, 118, '', '2025-02-20 16:08:52'),
(1419, 701, 119, '', '2025-02-20 16:09:02'),
(1420, 701, 120, '', '2025-02-20 16:09:10'),
(1421, 701, 121, '', '2025-02-20 16:09:18'),
(1422, 701, 122, '', '2025-02-20 16:09:28'),
(1423, 701, 123, '', '2025-02-20 16:09:36'),
(1424, 701, 124, '', '2025-02-20 16:09:46'),
(1425, 701, 125, '', '2025-02-20 16:09:54'),
(1426, 701, 126, '', '2025-02-20 16:10:11'),
(1427, 701, 127, '', '2025-02-20 16:10:23'),
(1428, 701, 128, '', '2025-02-20 16:11:17'),
(1429, 701, 129, '', '2025-02-20 16:11:29'),
(1430, 701, 130, '', '2025-02-20 16:11:40'),
(1431, 701, 131, '', '2025-02-20 16:11:49'),
(1432, 701, 132, '', '2025-02-20 16:11:59'),
(1433, 701, 133, '', '2025-02-20 16:12:11'),
(1434, 701, 134, '', '2025-02-20 16:12:23'),
(1435, 701, 135, '', '2025-02-20 16:12:33'),
(1436, 701, 136, '', '2025-02-20 16:12:47'),
(1437, 701, 137, '', '2025-02-20 16:13:04'),
(1438, 701, 138, '', '2025-02-20 16:13:15'),
(1439, 701, 139, '', '2025-02-20 16:13:23'),
(1440, 701, 140, '', '2025-02-20 16:13:33'),
(1441, 701, 141, '', '2025-02-20 16:14:43'),
(1442, 701, 142, '', '2025-02-20 16:14:11'),
(1443, 701, 143, '', '2025-02-20 16:14:57'),
(1444, 701, 144, '', '2025-02-20 16:15:07'),
(1445, 701, 145, '', '2025-02-20 16:15:20'),
(1446, 701, 146, '', '2025-02-20 16:15:32'),
(1447, 701, 147, '', '2025-02-20 16:15:59'),
(1448, 701, 148, '', '2025-02-20 16:17:00'),
(1449, 701, 149, '', '2025-02-20 16:17:20'),
(1450, 701, 150, '', '2025-02-20 16:17:33'),
(1451, 701, 151, '', '2025-02-20 16:17:54'),
(1452, 701, 152, '', '2025-02-20 16:18:10'),
(1453, 701, 153, '', '2025-02-20 16:18:22'),
(1454, 701, 154, '', '2025-02-20 16:18:36'),
(1455, 701, 155, '', '2025-02-20 16:18:50'),
(1456, 701, 156, '', '2025-02-20 16:19:03'),
(1457, 701, 157, '', '2025-02-20 16:19:15'),
(1458, 701, 158, '', '2025-02-20 16:19:32'),
(1459, 701, 159, '', '2025-02-20 16:19:42'),
(1460, 702, 101, '', '2025-02-22 08:58:01'),
(1461, 702, 102, '', '2025-02-22 08:58:01'),
(1462, 702, 103, '', '2025-02-22 08:58:01'),
(1463, 702, 104, '', '2025-02-22 08:58:01'),
(1464, 702, 105, '', '2025-02-22 08:58:01'),
(1465, 702, 106, '', '2025-02-22 08:58:01'),
(1466, 702, 107, '', '2025-02-22 08:58:01'),
(1467, 702, 108, '', '2025-02-22 08:58:01'),
(1468, 702, 109, '', '2025-02-22 08:58:01'),
(1469, 702, 110, '', '2025-02-22 08:58:01'),
(1470, 702, 111, '', '2025-02-22 08:58:01'),
(1471, 702, 112, '', '2025-02-22 08:58:01'),
(1472, 702, 113, '', '2025-02-22 08:58:01'),
(1473, 702, 114, '', '2025-02-22 08:58:01'),
(1474, 702, 115, '', '2025-02-22 08:58:01'),
(1475, 702, 116, '', '2025-02-22 08:58:01'),
(1476, 702, 117, '', '2025-02-22 08:58:01'),
(1477, 702, 118, '', '2025-02-22 08:58:01'),
(1478, 702, 119, '', '2025-02-22 08:58:01'),
(1479, 702, 120, '', '2025-02-22 08:58:01'),
(1480, 702, 121, '', '2025-02-22 08:58:01'),
(1481, 702, 122, '', '2025-02-22 08:58:01'),
(1482, 702, 123, '', '2025-02-22 08:58:01'),
(1483, 702, 124, '', '2025-02-22 08:58:01'),
(1484, 702, 125, '', '2025-02-22 08:58:01'),
(1485, 702, 126, '', '2025-02-22 08:58:01'),
(1486, 702, 127, '', '2025-02-22 08:58:01'),
(1487, 702, 128, '', '2025-02-22 08:58:01'),
(1488, 702, 129, '', '2025-02-22 08:58:01'),
(1489, 702, 130, '', '2025-02-22 08:58:01'),
(1490, 702, 131, '', '2025-02-22 08:58:01'),
(1491, 702, 132, '', '2025-02-22 08:58:01'),
(1492, 702, 133, '', '2025-02-22 08:58:01'),
(1493, 702, 134, '', '2025-02-22 08:58:01'),
(1494, 702, 135, '', '2025-02-22 08:58:01'),
(1495, 702, 136, '', '2025-02-22 08:58:01'),
(1496, 702, 137, '', '2025-02-22 08:58:01'),
(1497, 702, 138, '', '2025-02-22 08:58:01'),
(1498, 702, 139, '', '2025-02-22 08:58:01'),
(1499, 702, 140, '', '2025-02-22 08:58:01'),
(1500, 702, 141, '', '2025-02-22 08:58:01'),
(1501, 702, 142, '', '2025-02-22 08:58:01'),
(1502, 702, 143, '', '2025-02-22 08:58:01'),
(1503, 702, 144, '', '2025-02-22 08:58:01'),
(1504, 702, 145, '', '2025-02-22 08:58:01'),
(1505, 702, 146, '', '2025-02-22 08:58:01'),
(1506, 702, 147, '', '2025-02-22 08:58:01'),
(1507, 702, 148, '', '2025-02-22 08:58:01'),
(1508, 702, 149, '', '2025-02-22 08:58:01'),
(1509, 702, 150, '', '2025-02-22 08:58:01'),
(1510, 702, 151, '', '2025-02-22 08:58:01'),
(1511, 702, 152, '', '2025-02-22 08:58:01'),
(1512, 702, 153, '', '2025-02-22 08:58:01'),
(1513, 702, 154, '', '2025-02-22 08:58:01'),
(1514, 702, 155, '', '2025-02-22 08:58:01'),
(1515, 702, 156, '', '2025-02-22 08:58:01'),
(1516, 702, 157, '', '2025-02-22 08:58:01'),
(1517, 702, 158, '', '2025-02-22 08:58:01'),
(1518, 702, 159, '', '2025-02-22 08:58:01'),
(1519, 702, 160, '', '2025-02-22 08:58:01'),
(1520, 703, 101, '', '2025-02-22 08:59:39'),
(1521, 703, 102, '', '2025-02-22 08:59:39'),
(1522, 703, 103, '', '2025-02-22 08:59:39'),
(1523, 703, 104, '', '2025-02-22 08:59:39'),
(1524, 703, 105, '', '2025-02-22 08:59:39'),
(1525, 703, 106, '', '2025-02-22 08:59:39'),
(1526, 703, 107, '', '2025-02-22 08:59:39'),
(1527, 703, 108, '', '2025-02-22 08:59:39'),
(1528, 703, 109, '', '2025-02-22 08:59:39'),
(1529, 703, 110, '', '2025-02-22 08:59:39'),
(1530, 703, 111, '', '2025-02-22 08:59:39'),
(1531, 703, 112, '', '2025-02-22 08:59:39'),
(1532, 703, 113, '', '2025-02-22 08:59:39'),
(1533, 703, 114, '', '2025-02-22 08:59:39'),
(1534, 703, 115, '', '2025-02-22 08:59:39'),
(1535, 703, 116, '', '2025-02-22 08:59:39'),
(1536, 703, 117, '', '2025-02-22 08:59:39'),
(1537, 703, 118, '', '2025-02-22 08:59:39'),
(1538, 703, 119, '', '2025-02-22 08:59:39'),
(1539, 703, 120, '', '2025-02-22 08:59:39'),
(1540, 703, 121, '', '2025-02-22 08:59:39'),
(1541, 703, 122, '', '2025-02-22 08:59:39'),
(1542, 703, 123, '', '2025-02-22 08:59:39'),
(1543, 703, 124, '', '2025-02-22 08:59:39'),
(1544, 703, 125, '', '2025-02-22 08:59:39'),
(1545, 703, 126, '', '2025-02-22 08:59:39'),
(1546, 703, 127, '', '2025-02-22 08:59:39'),
(1547, 703, 128, '', '2025-02-22 08:59:39'),
(1548, 703, 129, '', '2025-02-22 08:59:39'),
(1549, 703, 130, '', '2025-02-22 08:59:39'),
(1550, 703, 131, '', '2025-02-22 08:59:39'),
(1551, 703, 132, '', '2025-02-22 08:59:39'),
(1552, 703, 133, '', '2025-02-22 08:59:39'),
(1553, 703, 134, '', '2025-02-22 08:59:39'),
(1554, 703, 135, '', '2025-02-22 08:59:39'),
(1555, 703, 136, '', '2025-02-22 08:59:39'),
(1556, 703, 137, '', '2025-02-22 08:59:39'),
(1557, 703, 138, '', '2025-02-22 08:59:39'),
(1558, 703, 139, '', '2025-02-22 08:59:39'),
(1559, 703, 140, '', '2025-02-22 08:59:39'),
(1560, 703, 141, '', '2025-02-22 08:59:39'),
(1561, 703, 142, '', '2025-02-22 08:59:39'),
(1562, 703, 143, '', '2025-02-22 08:59:39'),
(1563, 703, 144, '', '2025-02-22 08:59:39'),
(1564, 703, 145, '', '2025-02-22 08:59:39'),
(1565, 703, 146, '', '2025-02-22 08:59:39'),
(1566, 703, 147, '', '2025-02-22 08:59:39'),
(1567, 703, 148, '', '2025-02-22 08:59:39'),
(1568, 703, 149, '', '2025-02-22 08:59:39'),
(1569, 703, 150, '', '2025-02-22 08:59:39'),
(1570, 703, 151, '', '2025-02-22 08:59:39'),
(1571, 703, 152, '', '2025-02-22 08:59:39'),
(1572, 703, 153, '', '2025-02-22 08:59:39'),
(1573, 703, 154, '', '2025-02-22 08:59:39'),
(1574, 703, 155, '', '2025-02-22 08:59:39'),
(1575, 703, 156, '', '2025-02-22 08:59:39'),
(1576, 703, 157, '', '2025-02-22 08:59:39'),
(1577, 703, 158, '', '2025-02-22 08:59:39'),
(1578, 703, 159, '', '2025-02-22 08:59:39'),
(1579, 703, 160, '', '2025-02-22 08:59:39'),
(1580, 704, 101, '', '2025-02-22 08:54:29'),
(1581, 704, 102, '', '2025-02-22 08:54:29'),
(1582, 704, 103, '', '2025-02-22 08:54:29'),
(1583, 704, 104, '', '2025-02-22 08:54:29'),
(1584, 704, 105, '', '2025-02-22 08:54:29'),
(1585, 704, 106, '', '2025-02-22 08:54:29'),
(1586, 704, 107, '', '2025-02-22 08:54:29'),
(1587, 704, 108, '', '2025-02-22 08:54:29'),
(1588, 704, 109, '', '2025-02-22 08:54:29'),
(1589, 704, 110, '', '2025-02-22 08:54:29'),
(1590, 704, 111, '', '2025-02-22 08:54:29'),
(1591, 704, 112, '', '2025-02-22 08:54:29'),
(1592, 704, 113, '', '2025-02-22 08:54:29'),
(1593, 704, 114, '', '2025-02-22 08:54:29'),
(1594, 704, 115, '', '2025-02-22 08:54:29'),
(1595, 704, 118, '', '2025-02-22 09:08:12'),
(1596, 704, 121, '', '2025-02-22 09:08:43'),
(1597, 704, 128, '', '2025-02-22 09:11:05'),
(1598, 704, 132, '', '2025-02-22 09:11:58'),
(1599, 704, 134, '', '2025-02-22 09:12:09'),
(1600, 704, 135, '', '2025-02-22 09:12:19'),
(1601, 704, 136, '', '2025-02-22 09:12:30'),
(1602, 704, 137, '', '2025-02-22 09:12:42'),
(1603, 704, 138, '', '2025-02-22 09:12:53'),
(1604, 704, 139, '', '2025-02-22 09:13:03'),
(1605, 704, 140, '', '2025-02-22 09:13:16'),
(1606, 704, 141, '', '2025-02-22 09:13:28'),
(1607, 704, 128, '', '2025-02-22 08:54:29'),
(1608, 704, 129, '', '2025-02-22 08:54:29'),
(1609, 704, 130, '', '2025-02-22 08:54:29'),
(1610, 704, 131, '', '2025-02-22 08:54:29'),
(1611, 704, 132, '', '2025-02-22 08:54:29'),
(1612, 704, 133, '', '2025-02-22 08:54:29'),
(1613, 704, 134, '', '2025-02-22 08:54:29'),
(1614, 704, 135, '', '2025-02-22 08:54:29'),
(1615, 704, 136, '', '2025-02-22 08:54:29'),
(1616, 704, 137, '', '2025-02-22 08:54:29'),
(1617, 704, 138, '', '2025-02-22 08:54:29'),
(1618, 704, 139, '', '2025-02-22 08:54:29'),
(1619, 704, 140, '', '2025-02-22 08:54:29'),
(1620, 704, 141, '', '2025-02-22 09:16:00'),
(1621, 704, 144, '', '2025-02-22 09:16:42'),
(1622, 704, 146, '', '2025-02-22 09:19:45'),
(1623, 704, 147, '', '2025-02-22 09:19:45'),
(1624, 704, 148, '', '2025-02-22 09:19:45'),
(1625, 704, 149, '', '2025-02-22 09:19:45'),
(1626, 704, 150, '', '2025-02-22 09:19:45'),
(1627, 704, 151, '', '2025-02-22 09:19:45'),
(1628, 704, 152, '', '2025-02-22 09:19:45'),
(1629, 704, 153, '', '2025-02-22 09:19:45'),
(1630, 704, 154, '', '2025-02-22 09:19:45'),
(1631, 705, 101, '', '2025-02-22 09:23:29'),
(1632, 705, 102, '', '2025-02-22 09:23:29'),
(1633, 705, 103, '', '2025-02-22 09:23:29'),
(1634, 705, 104, '', '2025-02-22 09:23:29'),
(1635, 705, 105, '', '2025-02-22 09:23:29'),
(1636, 705, 106, '', '2025-02-22 09:23:29'),
(1637, 705, 107, '', '2025-02-22 09:23:29'),
(1638, 705, 108, '', '2025-02-22 09:23:29'),
(1639, 705, 109, '', '2025-02-22 09:23:29'),
(1640, 705, 110, '', '2025-02-22 09:23:29'),
(1641, 705, 111, '', '2025-02-22 09:23:29'),
(1642, 705, 112, '', '2025-02-22 09:23:29'),
(1643, 705, 113, '', '2025-02-22 09:23:29'),
(1644, 705, 114, '', '2025-02-22 09:23:29'),
(1645, 705, 115, '', '2025-02-22 09:23:29'),
(1646, 705, 116, '', '2025-02-22 09:23:29'),
(1647, 705, 117, '', '2025-02-22 09:23:29'),
(1648, 705, 118, '', '2025-02-22 09:23:29'),
(1649, 705, 119, '', '2025-02-22 09:23:29'),
(1650, 705, 120, '', '2025-02-22 09:23:29'),
(1651, 705, 121, '', '2025-02-22 09:23:29'),
(1652, 705, 122, '', '2025-02-22 09:23:29'),
(1653, 705, 123, '', '2025-02-22 09:23:29'),
(1654, 705, 124, '', '2025-02-22 09:23:29'),
(1655, 705, 125, '', '2025-02-22 09:23:29'),
(1656, 705, 126, '', '2025-02-22 09:23:29'),
(1657, 705, 127, '', '2025-02-22 09:23:29'),
(1658, 705, 128, '', '2025-02-22 09:23:29'),
(1659, 705, 129, '', '2025-02-22 09:23:29'),
(1660, 705, 130, '', '2025-02-22 09:23:29'),
(1661, 705, 131, '', '2025-02-22 09:23:29'),
(1662, 705, 132, '', '2025-02-22 09:23:29'),
(1663, 705, 133, '', '2025-02-22 09:23:29'),
(1664, 705, 134, '', '2025-02-22 09:23:29'),
(1665, 705, 135, '', '2025-02-22 09:23:29'),
(1666, 705, 136, '', '2025-02-22 09:23:29'),
(1667, 705, 137, '', '2025-02-22 09:23:29'),
(1668, 705, 138, '', '2025-02-22 09:23:29'),
(1669, 705, 139, '', '2025-02-22 09:23:29'),
(1670, 705, 140, '', '2025-02-22 09:23:29'),
(1671, 705, 141, '', '2025-02-22 09:23:29'),
(1672, 705, 142, '', '2025-02-22 09:23:29'),
(1673, 705, 143, '', '2025-02-22 09:23:29'),
(1674, 705, 144, '', '2025-02-22 09:23:29'),
(1675, 705, 145, '', '2025-02-22 09:23:29'),
(1676, 705, 146, '', '2025-02-22 09:23:29'),
(1677, 705, 147, '', '2025-02-22 09:23:29'),
(1678, 705, 148, '', '2025-02-22 09:23:29'),
(1679, 705, 149, '', '2025-02-22 09:23:29'),
(1680, 705, 150, '', '2025-02-22 09:23:29'),
(1681, 705, 151, '', '2025-02-22 09:23:29'),
(1682, 705, 152, '', '2025-02-22 09:23:29'),
(1683, 705, 153, '', '2025-02-22 09:23:29'),
(1684, 705, 154, '', '2025-02-22 09:23:29'),
(1685, 705, 155, '', '2025-02-22 09:23:29'),
(1686, 705, 156, '', '2025-02-22 09:23:29'),
(1687, 705, 157, '', '2025-02-22 09:23:29'),
(1688, 705, 158, '', '2025-02-22 09:23:29'),
(1689, 705, 159, '', '2025-02-22 09:23:29'),
(1690, 705, 160, '', '2025-02-22 09:23:29'),
(1691, 705, 161, '', '2025-02-22 09:23:29'),
(1692, 705, 162, '', '2025-02-22 09:23:29'),
(1693, 705, 163, '', '2025-02-22 09:23:29'),
(1694, 705, 164, '', '2025-02-22 09:23:29'),
(1695, 705, 165, '', '2025-02-22 09:23:29'),
(1696, 705, 166, '', '2025-02-22 09:23:29'),
(1697, 705, 167, '', '2025-02-22 09:23:29'),
(1698, 705, 168, '', '2025-02-22 09:23:29'),
(1699, 705, 169, '', '2025-02-22 09:23:29'),
(1700, 705, 170, '', '2025-02-22 09:23:29'),
(1701, 705, 171, '', '2025-02-22 09:23:29'),
(1702, 705, 172, '', '2025-02-22 09:23:29');

-- --------------------------------------------------------

--
-- Table structure for table `payment`
--

CREATE TABLE `payment` (
  `payment_id` int NOT NULL,
  `getting_table_id` int NOT NULL,
  `payment_method` enum('QR prompay','credit') COLLATE utf8mb4_unicode_ci NOT NULL,
  `payment_timestamp` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `promotion_id` int NOT NULL,
  `total_payment` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `payment_verificatio`
--

CREATE TABLE `payment_verificatio` (
  `payment_verification_id` int NOT NULL,
  `payment_id` int NOT NULL,
  `approve` enum('completed','pending','failed') COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `promotion`
--

CREATE TABLE `promotion` (
  `promotion_id` int NOT NULL,
  `promotions_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `promotion_item`
--

CREATE TABLE `promotion_item` (
  `promotion_item_id` int NOT NULL,
  `promotion_id` int NOT NULL,
  `inventory_id` int NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `discount_type` enum('persentage','fixed_amount') COLLATE utf8mb4_unicode_ci NOT NULL,
  `discount_value` decimal(10,2) NOT NULL,
  `start_date` int NOT NULL,
  `end_date` int NOT NULL,
  `status` enum('active','expired') COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `quantity` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `raw_material`
--

CREATE TABLE `raw_material` (
  `raw_material_id` int NOT NULL,
  `item_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `category_id` int NOT NULL,
  `price_of_cost` decimal(10,2) NOT NULL,
  `quanity` decimal(10,2) NOT NULL,
  `unit` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Num_before_consumption` int NOT NULL,
  `warehouse_id` int NOT NULL,
  `image_url` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `raw_material`
--

INSERT INTO `raw_material` (`raw_material_id`, `item_name`, `description`, `category_id`, `price_of_cost`, `quanity`, `unit`, `Num_before_consumption`, `warehouse_id`, `image_url`) VALUES
(1, 'ผักบุ้ง', 'ผักบุ้ง - ผักที่คัดสรรมาอย่างดี ให้ความกรอบและรสชาติอร่อย ทานกับชาบูเข้ากันสุดๆ เสิร์ฟในปริมาณ 200 กรัม ทานคู่กับน้ำจิ้ม', 1101, 24.00, 1000.00, 'g.', 5, 1201, 'uploads/ผักบุ้ง.jpg'),
(2, 'ต้นหอมญี่ปุ่น', 'ต้นหอมญี่ปุ่น - ผักที่คัดสรรมาอย่างดี ให้ความกรอบและรสชาติอร่อย ทานกับชาบูเข้ากันสุดๆ เสิร์ฟในปริมาณ 200 กรัม เหมาะสำหรับเพิ่มความหวานให้กับน้ำซุป.', 1101, 70.00, 1000.00, 'g.', 5, 1201, 'uploads/ต้นหอม.jpg'),
(3, 'ข้าวโพดอ่อน', 'ข้าวโพดอ่อน - ผักปลอดสาร สดสะอาด เหมาะกับการทานคู่กับเนื้อและน้ำจิ้ม เพิ่มรสสัมผัสที่ลงตัว เสิร์ฟในปริมาณ 200 กรัมเหมาะกับน้ำซุปหอมๆ และทานคู่กับเนื้อสัตว์.', 1101, 50.00, 1000.00, 'g.', 5, 1201, 'uploads/ข้าวโพดอ่อน.jpg'),
(4, 'กวางตุ้ง', 'กวางตุ้ง - ผักสดใหม่ คัดสรรจากแหล่งคุณภาพ เหมาะสำหรับลวกในน้ำซุปร้อนๆ ให้รสชาติหวานกรอบ เสิร์ฟในปริมาณ 200 กรัม อร่อยเมื่อจุ่มในน้ำซุปแล้วทานกับน้ำจิ้ม', 1101, 14.00, 1000.00, 'g.', 5, 1201, 'uploads/กวางตุ้ง.jpg'),
(5, 'ผักขึ้นฉ่าย', 'ผักขึ้นฉ่าย - ผักสดใหม่ คัดสรรจากแหล่งคุณภาพ เหมาะสำหรับลวกในน้ำซุปร้อนๆ ให้รสชาติหวานกรอบ เสิร์ฟในปริมาณ 200 กรัม  เหมาะกับน้ำซุปหอมๆ และทานคู่กับเนื้อสัตว์.', 1101, 84.00, 500.00, 'g.', 5, 1201, 'uploads/ผักขึ้นฉ่าย.jpg'),
(6, 'ฮ่องเต้น้อย', 'ฮ่องเต้น้อย(เบบี้ฮ่องเต้) - ผักที่คัดสรรมาอย่างดี ให้ความกรอบและรสชาติอร่อย ทานกับชาบูเข้ากันสุดๆ เสิร์ฟในปริมาณ 200 กรัม อร่อยเมื่อจุ่มในน้ำซุปแล้วทานกับน้ำจิ้ม', 1101, 85.00, 1000.00, 'g.', 5, 1201, 'uploads/ฮ่องเต้น้อย.jpg'),
(7, 'ฟักทองญี่ปุ่น', 'ฟักทองญี่ปุ่น - ผักสดใหม่ คัดสรรจากแหล่งคุณภาพ เหมาะสำหรับลวกในน้ำซุปร้อนๆ ให้รสชาติหวานกรอบ เสิร์ฟในปริมาณ 200 กรัมอร่อยเมื่อจุ่มในน้ำซุปแล้วทานกับน้ำจิ้ม', 1101, 70.00, 1000.00, 'g.', 5, 1201, 'uploads/ฟักทองญี่ปุ่น.jpg'),
(8, 'วากาเมะเขียว', 'วากาเมะเขียว - ผักสดใหม่ คัดสรรจากแหล่งคุณภาพ เหมาะสำหรับลวกในน้ำซุปร้อนๆ ให้รสชาติหวานกรอบ เสิร์ฟในปริมาณ 100 กรัม เหมาะกับน้ำซุปหอมๆ และทานคู่กับเนื้อสัตว์.', 1101, 505.00, 500.00, 'g.', 5, 1201, 'uploads/wagame.jpg'),
(9, 'ผักกาดขาว', 'ผัดกาดขาว - ผักปลอดสาร สดสะอาด เหมาะกับการทานคู่กับเนื้อและน้ำจิ้ม เพิ่มรสสัมผัสที่ลงตัว เสิร์ฟในปริมาณ 200 กรัมเหมาะกับน้ำซุปหอมๆ และทานคู่กับเนื้อสัตว์.', 1101, 35.00, 1500.00, 'g.\r\n', 5, 1201, 'uploads/ผักกาดขาว.jpg'),
(10, 'เห็ดฟาง', 'เห็ดฟาง(ขนาดกลาง) - ผักสดใหม่ คัดสรรจากแหล่งคุณภาพ เหมาะสำหรับลวกในน้ำซุปร้อนๆ ให้รสชาติหวานกรอบ เสิร์ฟในปริมาณ 200 กรัม  เหมาะสำหรับเพิ่มความหวานให้กับน้ำซุป.', 1101, 80.00, 1000.00, 'g.', 5, 1201, 'uploads/เห็ดฟาง.jpg'),
(11, 'เห็ดหูหนู', 'เห็ดหูหนู - ผักปลอดสาร สดสะอาด เหมาะกับการทานคู่กับเนื้อและน้ำจิ้ม เพิ่มรสสัมผัสที่ลงตัว เสิร์ฟในปริมาณ 200 กรัม เหมาะกับน้ำซุปหอมๆ และทานคู่กับเนื้อสัตว์.', 1101, 60.00, 1000.00, 'g.', 5, 1201, 'uploads/เห็ดหูหนู.jpg'),
(12, 'เห็ดเข็มทอง', 'เห็มเข็มทอง - ผักที่คัดสรรมาอย่างดี ให้ความกรอบและรสชาติอร่อย ทานกับชาบูเข้ากันสุดๆ เสิร์ฟในปริมาณ 200 กรัม เหมาะสำหรับเพิ่มความหวานให้กับน้ำซุป.', 1101, 67.00, 1000.00, 'g.', 5, 1201, 'uploads/เห็ดเข็มทอง.jpg'),
(13, 'ข้าวโพด', 'ข้าวโพด(เบอร์ใหญ่) - ผักสดใหม่ คัดสรรจากแหล่งคุณภาพ เหมาะสำหรับลวกในน้ำซุปร้อนๆ ให้รสชาติหวานกรอบ เสิร์ฟในปริมาณ 200 กรัม เหมาะกับน้ำซุปหอมๆ และทานคู่กับเนื้อสัตว์.', 1101, 15.00, 1000.00, 'g.', 5, 1201, 'uploads/ข้าวโพด.jpg'),
(14, 'เห็ดชิเมจิขาว', 'เห็ดชิเมจิขาว - ผักสดใหม่ คัดสรรจากแหล่งคุณภาพ เหมาะสำหรับลวกในน้ำซุปร้อนๆ ให้รสชาติหวานกรอบ เสิร์ฟในปริมาณ 200 กรัม อร่อยเมื่อจุ่มในน้ำซุปแล้วทานกับน้ำจิ้มพอนสึ.', 1101, 85.00, 1000.00, 'g.\r\n', 5, 1201, 'uploads/เห็ดชิเมจิขาว.jpg'),
(15, 'เส้นอุด้ง', 'เส้นอุด้ง - ลูกชิ้นเนื้อแน่นเต็มคำ คัดสรรวัตถุดิบคุณภาพ เสริมรสชาติให้มื้อชาบูอร่อยยิ่งขึ้น เสิร์ฟในปริมาณ 200 กรัม เหมาะสำหรับใส่ในหม้อชาบูเพื่อเพิ่มรสชาติ.', 1103, 175.00, 1000.00, 'g.', 30, 1203, 'uploads/อุด้ง.png'),
(16, 'ลูกชิ้นปิงปอง', 'ลูกชิ้นปิงปอง(หมู) - ลูกชิ้นเนื้อแน่นเต็มคำ คัดสรรวัตถุดิบคุณภาพ เสริมรสชาติให้มื้อชาบูอร่อยยิ่งขึ้น เสิร์ฟในปริมาณ 200 กรัม เหมาะสำหรับใส่ในหม้อชาบูเพื่อเพิ่มรสชาติ.', 1103, 60.00, 1000.00, 'g.', 30, 1203, 'uploads/ลูกชิ้นปิงปอง.png'),
(17, 'ลูกชิ้นรักบี้', 'ลูกชิ้นรักบี้(ปลา) - ลูกชิ้นเนื้อแน่นเต็มคำ คัดสรรวัตถุดิบคุณภาพ เสริมรสชาติให้มื้อชาบูอร่อยยิ่งขึ้น เสิร์ฟในปริมาณ 200 กรัม  เหมาะสำหรับใส่ในหม้อชาบูเพื่อเพิ่มรสชาติ.', 1103, 87.00, 1000.00, 'g.', 30, 1203, 'uploads/ลูกชิ้นรักบี้.jpg'),
(18, 'ฟองเต้าหู้ม้วนห่อสาหร่าย', 'ฟองเต้าหู้ม้วนห่อสาหร่าย  ปรุงรสมาอย่างดี ลวกในน้ำซุปแล้วรสชาติกลมกล่อม เสิร์ฟในปริมาณ 100 กรัม  ทานคู่กับผักสดและน้ำซุปเข้มข้นเพื่อรสชาติที่ลงตัว.', 1103, 79.00, 120.00, 'g.', 30, 1203, 'uploads/เต้าหู้ม้วนห่อสาหร่าย.jpg'),
(19, 'คริสตัลไข่ปลา', 'คริสตัลไข่ปลา ปรุงรสมาอย่างดี ลวกในน้ำซุปแล้วรสชาติกลมกล่อม เสิร์ฟในปริมาณ 200 กรัม ทานคู่กับผักสดและน้ำซุปเข้มข้นเพื่อรสชาติที่ลงตัว.', 1103, 129.00, 500.00, 'g.', 30, 1203, 'uploads/คริสตัลไข่ปลา.jpg'),
(20, 'ลูกชิ้นกุ้ง', 'ลูกชิ้นกุ้ง - ลูกชิ้นเด้งๆ สูตรเฉพาะ นำไปลวกแล้วเพิ่มรสสัมผัสที่กรุบกรอบ เสิร์ฟในปริมาณ 200 กรัม  ทานคู่กับผักสดและน้ำซุปเข้มข้นเพื่อรสชาติที่ลงตัว.', 1103, 68.00, 500.00, 'g.', 30, 1203, 'uploads/ลูกชิ้นกุ้ง.jpg'),
(21, 'บะหมี่หยกไต้หวัน', 'บะหมี่หยกไต้หวัน  ปรุงรสมาอย่างดี ลวกในน้ำซุปแล้วรสชาติกลมกล่อม เสิร์ฟในปริมาณ 200 กรัม ทานคู่กับผักสดและน้ำซุปเข้มข้นเพื่อรสชาติที่ลงตัว.', 1103, 32.00, 500.00, 'g.', 30, 1203, 'uploads/บะหมี่หยกไต้หวัน.jpg'),
(22, 'ซาลาเปาหมูแดง', 'ซาลาเปาหมูแดง 37 g/15 ลูก เสิร์ฟในปริมาณ 4 ลูกช่วยเพิ่มรสชาติให้มื้อชาบูด้วยสัมผัสที่แตกต่าง.', 1105, 135.00, 555.00, 'g.', 10, 1206, 'uploads/ซาลาเปาหมูแดง.jpg'),
(23, 'ซาลาเปาหมูสับ', 'ซาลาเปาหมูสับ37 g/15 ลูก  เสิร์ฟในปริมาณ 4 ลูก ช่วยเพิ่มรสชาติให้มื้อชาบูด้วยสัมผัสที่แตกต่าง.', 1105, 135.00, 555.00, 'g.', 10, 1206, 'uploads/ซาลาเปาหมูสับ.jpg'),
(24, 'ซาลาเปาไส้ครีม', 'ซาลาเปาไส้ครีม37 g/15 ลูก เสิร์ฟในปริมาณ 4 ลูก  เหมาะสำหรับทานคู่กับน้ำซุปเข้มข้น.', 1105, 130.00, 555.00, 'g.', 10, 1206, 'uploads/ซาลาเปาไส้ครีม.jpg'),
(25, 'ซาลาเปาไส้ถั่วดำ', 'ซาลาเปาไส้ถั่วดำ34.6875g/16 ลูกเสิร์ฟในปริมาณ 4 ลูก ลวกในน้ำซุปแล้วทานกับเนื้อหรือผักเพื่อรสชาติที่สมบูรณ์.', 1105, 139.00, 555.00, 'g.', 10, 1206, 'uploads/ซาลาเปาไส้ถั่วดำ.jpg'),
(26, 'ขนมจีบหมู', 'ขนมจีบหมู 16g/40 ชิ้น เสิร์ฟในปริมาณ 5 ลูก เหมาะสำหรับทานคู่กับน้ำซุปเข้มข้น.', 1105, 159.00, 640.00, 'g.', 10, 1206, 'uploads/ขนมจีบหมู.jpg'),
(27, 'ฮะเก๋า', 'ฮะเก๋า 18 g/24ชิ้น เสิร์ฟในปริมาณ5 ลูก ลวกในน้ำซุปแล้วทานกับเนื้อหรือผักเพื่อรสชาติที่สมบูรณ์.', 1105, 179.00, 432.00, 'g.', 10, 1206, 'uploads/ฮะเก๋า.jpg'),
(28, 'เผือกทอด', 'เผือกทอด(เผือกหอม – เบอร์ใหญ่) เสิร์ฟในปริมาณ 200 กรัม  ช่วยเพิ่มรสชาติให้มื้อชาบูด้วยสัมผัสที่แตกต่าง.', 1105, 65.00, 1000.00, 'g.', 10, 1206, 'uploads/เผือกทอด.jpg'),
(29, 'ปอเปี๊ยะทอด', 'ปอเปี๊ยะทอด 14.86g/28 ชิ้นเสิร์ฟในปริมาณ 4 ลูก ลวกในน้ำซุปแล้วทานกับเนื้อหรือผักเพื่อรสชาติที่สมบูรณ์.', 1105, 35.00, 500.00, 'g.', 10, 1206, 'uploads/ปอเปี๊ยะทอด.jpg'),
(30, 'ขนมจีบกุ้ง', 'ขนมจีบกุ้ง16 g/30 ชิ้น เสิร์ฟในปริมาณ5ลูกช่วยเพิ่มรสชาติให้มื้อชาบูด้วยสัมผัสที่แตกต่าง.', 1105, 189.00, 480.00, 'g.', 10, 1206, 'uploads/ขนมจีบกุ้ง.jpg'),
(31, 'ขนมจีบปู', 'ขนมจีบปู16 g/30 ชิ้นเสิร์ฟในปริมาณ 5ลูก เหมาะสำหรับทานคู่กับน้ำซุปเข้มข้น.', 1105, 195.00, 480.00, 'g.', 10, 1206, 'uploads/ขนมจีบปู.jpg'),
(32, 'เฟรนฟราย', 'เฟรนฟราย  เสิร์ฟในปริมาณ 200 กรัม เหมาะสำหรับทานคู่กับน้ำซุปเข้มข้น.', 1105, 63.00, 1000.00, 'g.', 10, 1206, 'uploads/เฟรนช์ฟรายส์.jpg'),
(33, 'เสี่ยวหลงเปาไส้หมู', 'เสี่ยวหลงเปาไส้หมู30g/15ชิ้น  เสิร์ฟในปริมาณ 2ลูก ช่วยเพิ่มรสชาติให้มื้อชาบูด้วยสัมผัสที่แตกต่าง.', 1105, 120.00, 450.00, 'g.', 10, 1206, 'uploads/เสี่ยวหลงเปาไส้กุ้งและหมูสับ.jpg'),
(34, 'น้ำแร่', 'น้ำแร่(มงเฟอ)1000ml/6 ขวดเสิร์ฟในปริมาณ 0.5 กรัม', 1105, 85.00, 6000.00, 'ml', 10, 1206, 'uploads/น้ำแร่.jpg'),
(35, 'น้ำเก๊กฮวย', 'น้ำเก๊กฮวย350 ml/6ขวด เสิร์ฟในปริมาณ 0.5 กรัม', 1105, 71.00, 2100.00, 'ml', 10, 1206, 'uploads/น้ำเก๊กฮวย.jpg'),
(36, 'น้ำอัดลม', 'น้ำอัดลม(แฟนต้า,โค้ก,สไปร,เป๊ปซี่)1250 ml/12ขวด เสิร์ฟในปริมาณ 0.5 กรัม', 1105, 20.00, 15000.00, 'ml', 10, 1206, 'uploads/น้ำอัดลม.jpg'),
(37, 'ชาเขียวรสน้ำผึ้งมะนาว', 'ชาเขียวรสน้ำผึ้งมะนาว 500 ml/6ขวดเสิร์ฟในปริมาณ 0.5 กรัม', 1105, 30.00, 12000.00, 'ml\r\n', 10, 1206, 'uploads/ชาเขียวน้ำผึ้งมะนาว.jpg'),
(38, 'น้ำชาเขียวรสแตงโม', 'น้ำชาเขียว รสแตงโม360ml/6ขวด เสิร์ฟในปริมาณ 0.5 กรัม', 1105, 30.00, 2160.00, 'ml', 10, 1206, 'uploads/ชาเขียวรสแตงโม.png'),
(39, 'น้ำส้ม', 'น้ำส้ม เสิร์ฟในปริมาณ 0.5 กรัม', 1105, 289.00, 5000.00, 'ml', 10, 1206, 'uploads/น้ำส้ม.jpg'),
(40, 'น้ำมะพร้าว ', 'น้ำมะพร้าว 360ml/6ขวด เสิร์ฟในปริมาณ 0.5 กรัม', 1105, 129.00, 2160.00, 'ml', 10, 1206, 'uploads/น้ำมะพร้าว.jpg'),
(41, 'ชานมไข่มุก', 'ชานมไข่มุก 230ml/4ขวด เสิร์ฟในปริมาณ 0.5 กรัม', 1105, 85.00, 920.00, 'ml', 10, 1206, 'uploads/ชานมไข่มุก.jpg'),
(42, 'ทับทิมกรอบมะพร้าวอ่อน', 'ทับทิมกรอบมะพร้าวอ่อน160g/4ถุง  เสิร์ฟในปริมาณ 60 กรัม', 1105, 140.00, 640.00, 'g.', 10, 1206, 'uploads/ทับทิมกรอบ.jpg'),
(43, 'บัวลอย', 'บัวลอย (ร้อน)160g/4ถุง  เสิร์ฟในปริมาณ 60 กรัม ', 1105, 115.00, 640.00, 'g.', 10, 1206, 'uploads/บัวลอยร้อน.jpg'),
(44, 'บัวลอยน้ำขิง', 'บัวลอยน้ำขิง140g/4ถุงๆ เสิร์ฟในปริมาณ 60 กรัม', 1105, 140.00, 560.00, 'g.', 10, 1206, 'uploads/บัวลอยน้ำขิง.jpg'),
(45, 'บัวลอยไส้มันม่วง', 'บัวลอยไส้มันม่วง16g/30ชิ้น เสิร์ฟในปริมาณ 60 กรัม ', 1105, 170.00, 480.00, 'g.', 10, 1206, 'uploads/บัวลอยจิ มันม่วง (ร้อน).jpg'),
(46, 'แตงโม', 'แตงโม(ซอนญ่า) 1ลูก - ผลไม้สด หวานฉ่ำ เหมาะสำหรับทานปิดท้ายมื้อชาบูเพื่อเพิ่มความสดชื่น เสิร์ฟในปริมาณ 200 กรัม', 1107, 137.00, 3000.00, 'g.', 7, 1205, 'uploads/watermelon.jpg'),
(47, 'แอปเปิ้ล', 'แอปเปิ้ล(แดงฟูจิเบอร์ 125)4-8ลูก - ผลไม้คัดพิเศษ รสชาติกลมกล่อม เหมาะกับการล้างปากหลังทานอาหาร เสิร์ฟในปริมาณ 200 กรัม', 1107, 102.00, 500.00, 'g.', 7, 1205, 'uploads/apple.jpg'),
(48, 'กล้วยน้ำว้า', 'กล้วย(น้ำว้าห่ามปนสุก) 1 หวี - ผลไม้สด หวานฉ่ำ เหมาะสำหรับทานปิดท้ายมื้อชาบูเพื่อเพิ่มความสดชื่น เสิร์ฟในปริมาณ 200 กรัม', 1107, 35.00, 700.00, 'g.', 7, 1205, 'uploads/banana.jpg'),
(49, 'กีวี่ เขียว', 'กีวี่ เขียว(NewZealand) 27 ลูก - ผลไม้ตามฤดูกาล สดใหม่จากสวน รสชาติหวานธรรมชาติ เสิร์ฟในปริมาณ 200 กรัม', 1107, 1000.00, 10500.00, 'g.', 7, 1205, 'uploads/kiwi.jpg'),
(50, 'ทับทิม', 'ทับทิม(แบล็คไดมอนด์) - ผลไม้ตามฤดูกาล สดใหม่จากสวน รสชาติหวานธรรมชาติ เสิร์ฟในปริมาณ 200 กรัม', 1107, 119.00, 1000.00, 'g.', 7, 1205, 'uploads/Pomegranate.jpg'),
(51, 'สับปะรด', 'สับประรด(ปัตตาเวีย) 5 ลูก - ผลไม้สด หวานฉ่ำ เหมาะสำหรับทานปิดท้ายมื้อชาบูเพื่อเพิ่มความสดชื่น เสิร์ฟในปริมาณ 200 กรัม', 1107, 215.00, 1000.00, 'g.', 7, 1205, 'uploads/pineapple.jpg'),
(52, 'แคนตาลูป', 'แคนตาลูป(ซันเลดี้ )1ลูก - ผลไม้สด หวานฉ่ำ เหมาะสำหรับทานปิดท้ายมื้อชาบูเพื่อเพิ่มความสดชื่น เสิร์ฟในปริมาณ 200 กรัม', 1107, 79.00, 1200.00, 'g.', 7, 1205, 'uploads/cantaloupe.jpg'),
(53, 'แก้วมังกร', 'แก้วมังกร(เนื้อแดง ) - ผลไม้ตามฤดูกาล สดใหม่จากสวน รสชาติหวานธรรมชาติ เสิร์ฟในปริมาณ 200 กรัม', 1107, 210.00, 2000.00, 'g.', 7, 1205, 'uploads/dragon fruit.jpg'),
(54, 'ส้ม', 'ส้ม(ซันควิกซ์) - ผลไม้สด หวานฉ่ำ เหมาะสำหรับทานปิดท้ายมื้อชาบูเพื่อเพิ่มความสดชื่น เสิร์ฟในปริมาณ 200 กรัม ', 1107, 220.00, 2000.00, 'g.', 7, 1205, 'uploads/orange.jpg'),
(55, 'หมูนุ่มโรยงา', 'หมูนุ่มโรยงา - เนื้อสัตว์สดใหม่ คัดพิเศษ ลวกแค่ไม่กี่วินาทีในน้ำซุปก็พร้อมละลายในปาก เสิร์ฟในปริมาณ 100 กรัม ', 1102, 70.00, 5000.00, 'g.', 3, 1202, 'uploads/หมูนุ่มโรยงา.png'),
(56, 'สันคอหมูสไลซ์', 'สันคอหมูสไลซ์ - เนื้อสัตว์สดใหม่ คัดพิเศษ ลวกแค่ไม่กี่วินาทีในน้ำซุปก็พร้อมละลายในปาก เสิร์ฟในปริมาณ 100 กรัม ', 1102, 189.00, 1000.00, 'g.', 3, 1202, 'uploads/สันคอหมูสไลซ์.png'),
(57, 'สันคอคุโรบูตะสไลซ์', 'สันคอคุโรบูตะสไลซ์ - เนื้อคุณภาพระดับพรีเมียม สไลซ์บางกำลังดี เมื่อลวกในน้ำซุปจะให้รสชาติที่นุ่มละมุน เสิร์ฟในปริมาณ 100 กรัม ', 1102, 987.00, 3000.00, 'g.', 3, 1202, 'uploads/สันคอคุโรบูตะสไลซ์.png'),
(58, 'สามชั้นสไลซ์', 'สามชั้นสไลซ์ - เนื้อสัตว์สดใหม่ คัดพิเศษ ลวกแค่ไม่กี่วินาทีในน้ำซุปก็พร้อมละลายในปาก เสิร์ฟในปริมาณ 100 กรัม', 1102, 198.00, 1000.00, 'g.', 3, 1202, 'uploads/สามชั้นสไลด์.png'),
(59, 'หมูบะช่อทรงเครื่อง', 'หมูบะช่อทรงเครื่อง - เนื้อคุณภาพระดับพรีเมียม สไลซ์บางกำลังดี เมื่อลวกในน้ำซุปจะให้รสชาติที่นุ่มละมุน เสิร์ฟในปริมาณ 100 กรัม ', 1102, 139.00, 1000.00, 'g.', 3, 1202, 'uploads/หมูบะช่อ.png'),
(60, 'แมงกะพรุน', 'แมงกะพรุน - กุ้งสดตัวโต หวานกรอบ เมื่อลวกแล้วเนื้อแน่น เด้งอร่อย เสิร์ฟในปริมาณ 100 กรัม ', 1104, 125.00, 1000.00, 'g.', 2, 1204, 'uploads/แมงกะพรุน.png'),
(61, 'หอยเป๋าฮื้อ', 'หอยเป๋าฮื้อ 60g/1ตัว - กุ้งสดตัวโต หวานกรอบ เมื่อลวกแล้วเนื้อแน่น เด้งอร่อย เสิร์ฟในปริมาณ 100 กรัม ', 1104, 1500.00, 1000.00, 'g.', 2, 1204, 'uploads/หอยเป่าฮื้อ.jpg'),
(62, 'เนื้อปลาแพนกาเซียสดอลลี่', 'เนื้อปลาแพนกาเซียสดอลลี่ - ปลาหมึกสด หวานธรรมชาติ เมื่อลวกในน้ำซุปแล้วจะให้รสสัมผัสหนึบหนับ เสิร์ฟในปริมาณ 100 กรัม ', 1104, 75.00, 1000.00, 'g.', 2, 1204, 'uploads/เนื้อปลาแพนกาเซีย.jpg'),
(63, 'ปลาหมึกสด', 'ปลาหมึกสด - กุ้งสดตัวโต หวานกรอบ เมื่อลวกแล้วเนื้อแน่น เด้งอร่อย เสิร์ฟในปริมาณ 100 กรัม ', 1104, 149.00, 800.00, 'g.', 2, 1204, 'uploads/ปลาหมึก.png'),
(64, 'เนื้อกุ้งขาว', 'เนื้อกุ้งขาว - อาหารทะเลสดใหม่ คัดจากแหล่งคุณภาพ เมื่อลวกในน้ำซุปให้รสชาติที่หอมหวานจากทะเล เสิร์ฟในปริมาณ 100 กรัม ', 1104, 225.00, 1000.00, 'g.', 2, 1204, 'uploads/เนื้อกุ้งสด.jpg'),
(65, 'หอยแมลงภู่นิวซีแลนด์', 'หอยแมลงภู่นิวซีแลนด์ - อาหารทะเลสดใหม่ คัดจากแหล่งคุณภาพ เมื่อลวกในน้ำซุปให้รสชาติที่หอมหวานจากทะเล เสิร์ฟในปริมาณ 100 กรัม ', 1104, 329.00, 1000.00, 'g.', 2, 1204, 'uploads/หอยแมลงภู่นิวซีแลนด์.jpg'),
(67, 'เนื้อบริสเกต AUS สไลซ์', 'เนื้อบริสเกต AUS สไลซ์ - เนื้อชั้นดี คัดจากส่วนที่มีไขมันแทรกกำลังดี เมื่อลวกแล้วให้รสชาติเข้มข้น เสิร์ฟในปริมาณ 100 กรัม ', 1102, 550.00, 1000.00, 'g.', 3, 1202, 'uploads/เนื้อบริสเกต AUS สไลซ์.jpg'),
(68, 'เนื้อนำเข้าสันคอวัว Australia สไลซ์', 'เนื้อนำเข้าสันคอวัว Australia สไลซ์ - เนื้อสัตว์สดใหม่ คัดพิเศษ ลวกแค่ไม่กี่วินาทีในน้ำซุปก็พร้อมละลายในปาก เสิร์ฟในปริมาณ 100 กรัม ', 1102, 289.00, 500.00, 'g.', 3, 1202, 'uploads/เนื้อนำเข้าสันคอวัว Australia สไลซ์.jpg'),
(69, 'เนื้อวัวอเมริกาส่วนพื้นท้องสไลด์', 'เนื้อวัวอเมริกาส่วนพื้นท้องสไลด์ - เนื้อชั้นดี คัดจากส่วนที่มีไขมันแทรกกำลังดี เมื่อลวกแล้วให้รสชาติเข้มข้น เสิร์ฟในปริมาณ 100 กรัม', 1102, 830.00, 1000.00, 'g.', 3, 1202, 'uploads/เนื้อวัวอเมริกาส่วนพื้นท้องสไลด์.jpg'),
(70, 'เนื้อพื้นท้องวัวออสเตรเลียสไลซ์แช่แข็ง', 'เนื้อพื้นท้องวัวออสเตรเลียสไลซ์แช่แข็ง - เนื้อสัตว์สดใหม่ คัดพิเศษ ลวกแค่ไม่กี่วินาทีในน้ำซุปก็พร้อมละลายในปาก เสิร์ฟในปริมาณ 100 กรัม', 1102, 289.00, 500.00, 'g.', 3, 1202, 'uploads/เนื้อพื้นท้องวัวออสเตรเลียสไลซ์แช่แข็ง.jpg'),
(71, 'เนื้อวากิวญี่ปุ่น A4', 'เนื้อวากิวญี่ปุ่น A4 - เนื้อสัตว์สดใหม่ คัดพิเศษ ลวกแค่ไม่กี่วินาทีในน้ำซุปก็พร้อมละลายในปาก เสิร์ฟในปริมาณ 100 กรัม', 1102, 2950.00, 1000.00, 'g.', 3, 1202, 'uploads/A4.png'),
(72, 'เนื้อวากิวญี่ปุ่น A5', 'เนื้อวากิวญี่ปุ่น A5 - เนื้อชั้นดี คัดจากส่วนที่มีไขมันแทรกกำลังดี เมื่อลวกแล้วให้รสชาติเข้มข้น เสิร์ฟในปริมาณ 100 กรัม ', 1102, 3750.00, 1000.00, 'g.', 3, 1202, 'uploads/A5.png'),
(73, 'น้ำซุปน้ำดำ', 'น้ำซุปน้ำดำ - น้ำซุปที่ผ่านการเคี่ยวนานหลายชั่วโมง หอมลึกซึ้ง และช่วยเพิ่มรสชาติให้กับทุกวัตถุดิบ เสิร์ฟในปริมาณ 600 กรัม ', 1106, 45.00, 300.00, 'g.', 5, 1207, 'uploads/น้ำซุปน้ำดำ.jpg'),
(74, 'น้ำซุปหมาล่า', 'น้ำซุปหมาล่า - น้ำซุปที่ผ่านการเคี่ยวนานหลายชั่วโมง หอมลึกซึ้ง และช่วยเพิ่มรสชาติให้กับทุกวัตถุดิบ เสิร์ฟในปริมาณ 600 กรัม ', 1106, 55.00, 300.00, 'g.', 5, 1207, 'uploads/ซุปหม่าล่า.png'),
(75, 'น้ำซุปน้ำใส', 'น้ำซุปน้ำใส - น้ำซุปกลมกล่อม เคี่ยวจากวัตถุดิบคุณภาพ เหมาะสำหรับลวกเนื้อและผัก เสิร์ฟในปริมาณ 600 กรัม', 1106, 45.00, 300.00, 'g.', 5, 1207, 'uploads/น้ำซุปต้นตำรับ.jpg'),
(76, 'น้ำจิ้มสุกกี้', 'น้ำจิ้มสุกกี้(พันท้าย) - น้ำจิ้มพอนสึรสเปรี้ยวเค็มหวาน ช่วยเสริมรสชาติของเนื้อให้โดดเด่น เสิร์ฟในปริมาณ 45 กรัม ', 1108, 98.00, 800.00, 'g.', 15, 1208, 'uploads/น้ำจิ้มสุกี้.png'),
(77, 'น้ำจิ้มซีฟู๊ด', 'น้ำจิ้ิ้มซีฟู๊ด - น้ำจิ้มพอนสึรสเปรี้ยวเค็มหวาน ช่วยเสริมรสชาติของเนื้อให้โดดเด่น เสิร์ฟในปริมาณ 45 กรัม', 1108, 59.00, 335.00, 'g.', 15, 1208, 'uploads/น้ำจิ้มซีฟู้ด.png'),
(78, 'น้ำจิ้มงา', 'น้ำจิ้มงา - น้ำจิ้มสุกี้สูตรเข้มข้น รสชาติกลมกล่อม เพิ่มความอร่อยให้กับชาบู เสิร์ฟในปริมาณ 45 กรัม', 1108, 152.00, 850.00, 'g.', 15, 1208, 'uploads/น้ำจิ้มงา.png'),
(79, 'พริกยอดสนแดง', 'พริกยอดสนแดง - น้ำจิ้มสุกี้สูตรเข้มข้น รสชาติกลมกล่อม เพิ่มความอร่อยให้กับชาบู เสิร์ฟในปริมาณ 15 กรัม', 1108, 50.00, 1000.00, 'g.', 15, 1208, 'uploads/พริกสับ.png'),
(80, 'กระเทียม', 'กระเทียม - น้ำจิ้มงาหอมมัน ผสมงาคั่วและเครื่องปรุงพิเศษ เสริมรสชาติให้เนื้อและผักอร่อยยิ่งขึ้น เสิร์ฟในปริมาณ 15 กรัม', 1108, 70.00, 1000.00, 'g.', 15, 1208, 'uploads/กระเทียมสับ.png'),
(81, 'มะนาว', 'มะนาว (ml) 3 ขวด - น้ำจิ้มพอนสึรสเปรี้ยวเค็มหวาน ช่วยเสริมรสชาติของเนื้อให้โดดเด่น เสิร์ฟในปริมาณ 30 กรัม ', 1108, 69.00, 3000.00, 'g.', 15, 1208, 'uploads/มะนาว.png');

-- --------------------------------------------------------

--
-- Table structure for table `receipt`
--

CREATE TABLE `receipt` (
  `receipt_id` int NOT NULL,
  `payment_verification_id` int NOT NULL,
  `employee_id` int NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `reservation`
--

CREATE TABLE `reservation` (
  `reservation_id` int(11) NOT NULL,
  `first_name` varchar(255) NOT NULL,
  `last_name` varchar(255) NOT NULL,
  `number_of_guest` int(11) NOT NULL,
  `status` enum('Confirm','Cancel') NOT NULL,
  `time_update` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `availability_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `reservation`
--

INSERT INTO `reservation` (`reservation_id`, `first_name`, `last_name`, `number_of_guest`, `status`, `time_update`, `availability_id`) VALUES
(170771, 'สมหญิง', 'สุดสวย', 3, 'Confirm', '2025-02-11 11:29:47', 420),
(333518, 'ชบา', 'ชื่นชม', 2, 'Confirm', '2025-02-10 20:58:48', 116),
(490506, 'ชบา', 'ชื่นชม', 2, 'Cancel', '2025-02-11 06:35:46', 216),
(494181, 'วินัย', 'ทองโต', 3, 'Confirm', '2025-02-12 09:43:21', 120),
(502000, 'ชบา', 'ชื่นชม', 2, 'Cancel', '2025-02-10 20:53:54', 116),
(506815, 'วินัย', 'ทองโต', 3, 'Confirm', '2025-02-20 23:02:44', 318),
(563478, 'ดาวเรือง', 'พรศักดิ์ส่องแสง', 4, 'Confirm', '2025-02-11 11:29:17', 316),
(573061, 'สมหมาย', 'สุดหล่อ', 5, 'Confirm', '2025-02-11 10:18:40', 118),
(833076, 'ชบา', 'ชื่นชม', 2, 'Cancel', '2025-02-11 09:10:54', 316),
(865697, 'วินัย', 'ทองโต', 3, 'Confirm', '2025-02-11 11:30:21', 1120),
(981784, 'ชบา', 'ชื่นชม', 2, 'Cancel', '2025-02-11 04:12:29', 216);

--
-- Triggers `reservation`
--
DELIMITER $$
CREATE TRIGGER `before_insert_reservation` BEFORE INSERT ON `reservation` FOR EACH ROW BEGIN
    SET NEW.reservation_id = LPAD(FLOOR(RAND() * 1000000), 6, '0');
END
$$
DELIMITER ;

-- --------------------------------------------------------

--
-- Table structure for table `review`
--

CREATE TABLE `review` (
  `review_id` int NOT NULL,
  `receipt_id` int NOT NULL,
  `comment_text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `tag_food_id` int DEFAULT NULL,
  `tag_clean_id` int DEFAULT NULL,
  `tag_price_id` int DEFAULT NULL,
  `tag_service_id` int DEFAULT NULL,
  `tag_other_id` int DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `role`
--

CREATE TABLE `role` (
  `role_id` int NOT NULL,
  `role_name` tinytext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `permissions` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `role`
--

INSERT INTO `role` (`role_id`, `role_name`, `description`, `permissions`) VALUES
(201, 'พนักงานทำความสะอาด', '00', '[\"clean_areas\", \"dispose_trash\"]'),
(202, 'พนักงานเสิร์ฟ', '00', '[\"serve_food\", \"take_orders\", \"handle_payments\"]'),
(203, 'พนักงานต้อนรับ', '00', '[\"greet_customers\", \"manage_reservations\", \"assign_seats\"]'),
(204, 'พนักงานคลัง', '00', '[\"manage_inventory\", \"receive_shipments\", \"track_stock\"]'),
(205, 'พนักงานครัว', '00', '[\"prepare_food\", \"manage_kitchen\", \"handle_ingredients\"]'),
(206, 'พนักงานเคาท์เตอร์', '00', '[\"process_payments\", \"handle_orders\", \"customer_service\"]');

-- --------------------------------------------------------

--
-- Table structure for table `selecting_item`
--

CREATE TABLE `selecting_item` (
  `selecting_item_id` int NOT NULL,
  `getting_table_id` int NOT NULL,
  `quanity` int NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `supplier`
--

CREATE TABLE `supplier` (
  `supplier_id` int NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `catagory_id` int NOT NULL,
  `phone` int NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `location` text COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `table`
--

CREATE TABLE `table` (
  `table_id` int NOT NULL,
  `table_type_id` int NOT NULL,
  `location` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `table`
--

INSERT INTO `table` (`table_id`, `table_type_id`, `location`) VALUES
(1, 104, 'หน้าชั้นวางเมนู'),
(2, 110, 'หน้าชั้นวางเมนู'),
(3, 110, 'หน้าชั้นวางเมนู'),
(4, 110, 'หน้าชั้นวางเมนู'),
(5, 104, 'เดินตรงเข้าไป ในสุด ใกล้ชั้นวางเมนู'),
(6, 104, 'ถัดจากโต๊ะ 5'),
(7, 104, 'ถัดจากโต๊ะ 6'),
(8, 104, 'ถัดจากโต๊ะ 7'),
(9, 104, 'ถัดจากโต๊ะ 8'),
(10, 104, 'ทางด้านขวาของร้าน ใกล้โต๊ะ 5'),
(11, 104, 'ทางด้านขวาของร้าน ใกล้โต๊ะ 6'),
(12, 104, 'ทางด้านขวาของร้าน ใกล้โต๊ะ 7'),
(13, 104, 'ทางด้านขวาของร้าน ใกล้โต๊ะ 8'),
(14, 104, 'ทางด้านขวาของร้าน ใกล้โต๊ะ 9'),
(15, 104, 'ติดกำแพงด้านขวา หน้าแคชเชียร์'),
(16, 104, 'ติดกำแพงด้านขวา ถัดจากโต๊ะ 15'),
(17, 104, 'ติดกำแพงด้านขวา ถัดจากโต๊ะ 16'),
(18, 104, 'ติดกำแพงด้านขวา ถัดจากโต๊ะ 17'),
(19, 104, 'ติดกำแพงด้านขวา ถัดจากโต๊ะ 18'),
(20, 104, 'ติดกำแพงด้านขวา ถัดจากโต๊ะ 19');

-- --------------------------------------------------------

--
-- Table structure for table `table_availability`
--

CREATE TABLE `table_availability` (
  `availability_id` int NOT NULL,
  `table_id` int NOT NULL,
  `time_id` int NOT NULL,
  `status` enum('Free','Busy') COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `table_availability`
--

INSERT INTO `table_availability` (`availability_id`, `table_id`, `time_id`, `status`, `last_update`) VALUES
(116, 1, 1001, 'Free', '0000-00-00 00:00:00'),
(118, 1, 1002, 'Free', '0000-00-00 00:00:00'),
(120, 1, 1003, 'Free', '0000-00-00 00:00:00'),
(122, 1, 1004, 'Free', '0000-00-00 00:00:00'),
(124, 1, 1005, 'Free', '0000-00-00 00:00:00'),
(216, 2, 1001, 'Free', '0000-00-00 00:00:00'),
(218, 2, 1002, 'Busy', '2025-02-22 07:41:07'),
(220, 2, 1003, 'Busy', '2025-02-22 07:37:57'),
(222, 2, 1004, 'Free', '0000-00-00 00:00:00'),
(224, 2, 1005, 'Free', '0000-00-00 00:00:00'),
(316, 3, 1001, 'Free', '2025-02-11 09:11:35'),
(318, 3, 1002, 'Free', '0000-00-00 00:00:00'),
(320, 3, 1003, 'Free', '0000-00-00 00:00:00'),
(322, 3, 1004, 'Free', '0000-00-00 00:00:00'),
(324, 3, 1005, 'Free', '0000-00-00 00:00:00'),
(416, 4, 1001, 'Free', '0000-00-00 00:00:00'),
(418, 4, 1002, 'Free', '0000-00-00 00:00:00'),
(420, 4, 1003, 'Free', '0000-00-00 00:00:00'),
(422, 4, 1004, 'Free', '0000-00-00 00:00:00'),
(424, 4, 1005, 'Free', '0000-00-00 00:00:00'),
(516, 5, 1001, 'Free', '0000-00-00 00:00:00'),
(518, 5, 1002, 'Free', '0000-00-00 00:00:00'),
(520, 5, 1003, 'Free', '0000-00-00 00:00:00'),
(522, 5, 1004, 'Free', '0000-00-00 00:00:00'),
(524, 5, 1005, 'Free', '0000-00-00 00:00:00'),
(616, 6, 1001, 'Free', '0000-00-00 00:00:00'),
(618, 6, 1002, 'Free', '0000-00-00 00:00:00'),
(620, 6, 1003, 'Free', '0000-00-00 00:00:00'),
(622, 6, 1004, 'Free', '0000-00-00 00:00:00'),
(624, 6, 1005, 'Free', '0000-00-00 00:00:00'),
(716, 7, 1001, 'Free', '0000-00-00 00:00:00'),
(718, 7, 1002, 'Free', '0000-00-00 00:00:00'),
(720, 7, 1003, 'Free', '0000-00-00 00:00:00'),
(722, 7, 1004, 'Free', '0000-00-00 00:00:00'),
(724, 7, 1005, 'Free', '0000-00-00 00:00:00'),
(816, 8, 1001, 'Free', '0000-00-00 00:00:00'),
(818, 8, 1002, 'Free', '0000-00-00 00:00:00'),
(820, 8, 1003, 'Free', '0000-00-00 00:00:00'),
(822, 8, 1004, 'Free', '0000-00-00 00:00:00'),
(824, 8, 1005, 'Free', '0000-00-00 00:00:00'),
(916, 9, 1001, 'Free', '0000-00-00 00:00:00'),
(918, 9, 1002, 'Free', '0000-00-00 00:00:00'),
(920, 9, 1003, 'Free', '0000-00-00 00:00:00'),
(922, 9, 1004, 'Free', '0000-00-00 00:00:00'),
(924, 9, 1005, 'Free', '0000-00-00 00:00:00'),
(1016, 10, 1001, 'Free', '0000-00-00 00:00:00'),
(1018, 10, 1002, 'Free', '0000-00-00 00:00:00'),
(1020, 10, 1003, 'Free', '0000-00-00 00:00:00'),
(1022, 10, 1004, 'Free', '0000-00-00 00:00:00'),
(1024, 10, 1005, 'Free', '0000-00-00 00:00:00'),
(1116, 11, 1001, 'Free', '0000-00-00 00:00:00'),
(1118, 11, 1002, 'Free', '0000-00-00 00:00:00'),
(1120, 11, 1003, 'Free', '0000-00-00 00:00:00'),
(1122, 11, 1004, 'Free', '0000-00-00 00:00:00'),
(1124, 11, 1005, 'Free', '0000-00-00 00:00:00'),
(1216, 12, 1001, 'Free', '0000-00-00 00:00:00'),
(1218, 12, 1002, 'Free', '0000-00-00 00:00:00'),
(1220, 12, 1003, 'Free', '0000-00-00 00:00:00'),
(1222, 12, 1004, 'Free', '0000-00-00 00:00:00'),
(1224, 12, 1005, 'Free', '0000-00-00 00:00:00'),
(1316, 13, 1001, 'Free', '0000-00-00 00:00:00'),
(1318, 13, 1002, 'Free', '0000-00-00 00:00:00'),
(1320, 13, 1003, 'Free', '0000-00-00 00:00:00'),
(1322, 13, 1004, 'Free', '0000-00-00 00:00:00'),
(1324, 13, 1005, 'Free', '0000-00-00 00:00:00'),
(1416, 14, 1001, 'Free', '0000-00-00 00:00:00'),
(1418, 14, 1002, 'Free', '0000-00-00 00:00:00'),
(1420, 14, 1003, 'Free', '0000-00-00 00:00:00'),
(1422, 14, 1004, 'Free', '0000-00-00 00:00:00'),
(1424, 14, 1005, 'Free', '0000-00-00 00:00:00'),
(1516, 15, 1001, 'Free', '0000-00-00 00:00:00'),
(1518, 15, 1002, 'Free', '0000-00-00 00:00:00'),
(1520, 15, 1003, 'Free', '0000-00-00 00:00:00'),
(1522, 15, 1004, 'Free', '0000-00-00 00:00:00'),
(1524, 15, 1005, 'Free', '0000-00-00 00:00:00'),
(1616, 16, 1001, 'Free', '0000-00-00 00:00:00'),
(1618, 16, 1002, 'Free', '0000-00-00 00:00:00'),
(1620, 16, 1003, 'Free', '0000-00-00 00:00:00'),
(1622, 16, 1004, 'Free', '0000-00-00 00:00:00'),
(1624, 16, 1005, 'Free', '0000-00-00 00:00:00'),
(1716, 17, 1001, 'Free', '0000-00-00 00:00:00'),
(1718, 17, 1002, 'Free', '0000-00-00 00:00:00'),
(1720, 17, 1003, 'Free', '0000-00-00 00:00:00'),
(1722, 17, 1004, 'Free', '0000-00-00 00:00:00'),
(1724, 17, 1005, 'Busy', '0000-00-00 00:00:00'),
(1816, 18, 1001, 'Free', '0000-00-00 00:00:00'),
(1818, 18, 1002, 'Free', '0000-00-00 00:00:00'),
(1820, 18, 1003, 'Free', '0000-00-00 00:00:00'),
(1822, 18, 1004, 'Free', '0000-00-00 00:00:00'),
(1824, 18, 1005, 'Free', '0000-00-00 00:00:00'),
(1916, 19, 1001, 'Free', '0000-00-00 00:00:00'),
(1918, 19, 1002, 'Free', '0000-00-00 00:00:00'),
(1920, 19, 1003, 'Free', '0000-00-00 00:00:00'),
(1922, 19, 1004, 'Free', '0000-00-00 00:00:00'),
(1924, 19, 1005, 'Free', '0000-00-00 00:00:00'),
(2016, 20, 1001, 'Free', '0000-00-00 00:00:00'),
(2018, 20, 1002, 'Free', '0000-00-00 00:00:00'),
(2020, 20, 1003, 'Busy', '0000-00-00 00:00:00'),
(2022, 20, 1004, 'Free', '0000-00-00 00:00:00'),
(2024, 20, 1005, 'Free', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- Table structure for table `table_type`
--

CREATE TABLE `table_type` (
  `table_type_id` int NOT NULL,
  `table_type_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `capacity` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `table_type`
--

INSERT INTO `table_type` (`table_type_id`, `table_type_name`, `capacity`) VALUES
(104, 'โต๊ะเล็ก', 4),
(110, 'โต๊ะใหญ่', 10);

-- --------------------------------------------------------

--
-- Table structure for table `tag_clean`
--

CREATE TABLE `tag_clean` (
  `tag_clean_id` int NOT NULL,
  `tag_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `rating` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `tag_clean`
--

INSERT INTO `tag_clean` (`tag_clean_id`, `tag_name`, `rating`) VALUES
(1, 'สะอาดมาก', 5),
(2, 'โต๊ะสะอาด', 5),
(3, 'อุปกรณ์ครบ สะอาด', 5),
(4, 'มีระบบทำความสะอาดดี', 5),
(5, 'มีพนักงานเช็ดโต๊ะบ่อย', 4),
(6, 'หม้อมีคราบเล็กน้อย', 3),
(7, 'พื้นร้านลื่นเล็กน้อย', 2),
(8, 'โต๊ะไม่เช็ดให้ก่อนนั่ง', 2),
(9, 'ช้อน-ตะเกียบไม่สะอาด', 1),
(10, 'จานชามมีกลิ่น', 1);

-- --------------------------------------------------------

--
-- Table structure for table `tag_food`
--

CREATE TABLE `tag_food` (
  `tag_food_id` int NOT NULL,
  `tag_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `rating` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `tag_food`
--

INSERT INTO `tag_food` (`tag_food_id`, `tag_name`, `rating`) VALUES
(11, 'คุณภาพเนื้อดี', 5),
(12, 'ผักสดสะอาด', 5),
(13, 'น้ำซุปอร่อย', 5),
(14, 'น้ำจิ้มเด็ด', 5),
(15, 'อาหารหลากหลาย', 4),
(16, 'เติมของช้า ', 3),
(17, 'อาหารบางอย่างหมดไว', 3),
(18, 'ของไม่สด', 2),
(19, 'เนื้อหมดอายุ', 1),
(20, 'ผักไม่ล้าง', 1);

-- --------------------------------------------------------

--
-- Table structure for table `tag_other`
--

CREATE TABLE `tag_other` (
  `tag_other_id` int NOT NULL,
  `tag_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `rating` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `tag_other`
--

INSERT INTO `tag_other` (`tag_other_id`, `tag_name`, `rating`) VALUES
(41, 'บรรยากาศดี', 5),
(42, 'มีที่จอดรถ', 5),
(43, 'มีโต๊ะเยอะ', 5),
(44, 'นั่งสบาย ไม่อึดอัด', 5),
(45, 'เปิดเพลงเพราะ', 4),
(46, 'คนเยอะ รอคิวนาน', 3),
(47, 'ไม่มีที่จอดรถ', 3),
(48, 'เสียงดังไปหน่อย', 2),
(49, 'แอร์ร้อน', 1),
(50, 'ควันเยอะ กลิ่นติดตัว', 1);

-- --------------------------------------------------------

--
-- Table structure for table `tag_price`
--

CREATE TABLE `tag_price` (
  `tag_price_id` int NOT NULL,
  `tag_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `rating` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `tag_price`
--

INSERT INTO `tag_price` (`tag_price_id`, `tag_name`, `rating`) VALUES
(21, 'คุ้มค่ามาก', 5),
(22, 'อร่อย ราคาดี', 5),
(23, 'บุฟเฟ่ต์ราคาถูก', 5),
(24, 'โปรโมชั่นคุ้ม', 5),
(25, 'อาหารสมราคา', 4),
(26, 'มีค่าบริการเพิ่ม', 3),
(27, 'แอบแพงไปนิด', 0),
(28, 'เทียบกับคุณภาพไม่คุ้ม', 2),
(29, 'ราคาแพงเกินไป', 1),
(30, 'คิดเงินเกิน', 1);

-- --------------------------------------------------------

--
-- Table structure for table `tag_service`
--

CREATE TABLE `tag_service` (
  `tag_service_id` int NOT NULL,
  `tag_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `rating` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `tag_service`
--

INSERT INTO `tag_service` (`tag_service_id`, `tag_name`, `rating`) VALUES
(31, 'บริการดีมาก', 5),
(32, ' ยิ้มแย้มแจ่มใส', 5),
(33, 'ดูแลลูกค้าดี', 5),
(34, ' เรียกแล้วมาตลอด', 5),
(35, 'เติมน้ำซุปให้เอง', 4),
(36, 'พนักงานน้อยเกินไป', 3),
(37, 'บริการช้า', 3),
(38, 'เรียกแล้วไม่สนใจ', 1),
(39, 'หน้าตึงไม่พูดจา', 1),
(40, 'พนักงานหงุดหงิดใส่ลูกค้า', 1);

-- --------------------------------------------------------

--
-- Table structure for table `time_reserversion`
--

CREATE TABLE `time_reserversion` (
  `time_id` int NOT NULL,
  `time` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `time_reserversion`
--

INSERT INTO `time_reserversion` (`time_id`, `time`) VALUES
(1001, '16.00'),
(1002, '18.00'),
(1003, '20.00'),
(1004, '22.00'),
(1005, '00.00');

-- --------------------------------------------------------

--
-- Table structure for table `walkin`
--

CREATE TABLE `walkin` (
  `walkin_id` int NOT NULL,
  `frist_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `availability_id` int NOT NULL,
  `number_of_gest` int NOT NULL,
  `time_start` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `time_out` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `package_id` int NOT NULL,
  `promotion_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `warehouse`
--

CREATE TABLE `warehouse` (
  `warehouse_id` int NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `locations` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `capacity` int NOT NULL,
  `supplier_id` int NOT NULL,
  `discription` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `warehouse`
--

INSERT INTO `warehouse` (`warehouse_id`, `name`, `locations`, `capacity`, `supplier_id`, `discription`, `created_at`) VALUES
(1201, 'ตู้แช่ผัก', 'จ.พิษณุโลก', 0, 0, '', '2025-02-17 09:14:29'),
(1202, 'ตู้แช่เนื้อสัตว์', 'จ.พิษณุโลก', 0, 0, '', '2025-02-17 09:14:29'),
(1203, 'ตู้แช่อาหารแปรรูป', 'จ.พิษณุโลก', 0, 0, '', '2025-02-17 09:14:29'),
(1204, 'ตู้แช่อาหารทะเล', 'จ.พิษณุโลก', 0, 0, '', '2025-02-17 09:14:29'),
(1205, 'ตู้แช่ผลไม้', 'จ.พิษณุโลก', 0, 0, '', '2025-02-17 09:14:29'),
(1206, 'ตู้แช่อื่นๆ', 'จ.พิษณุโลก', 0, 0, '', '2025-02-17 09:14:29'),
(1207, 'ตู้แช่น้ำซุป', 'จ.พิษณุโลก', 0, 0, '', '2025-02-17 09:14:29'),
(1208, 'ตู้แช่น้ำจิ้ม', 'จ.พิษณุโลก', 0, 0, '', '2025-02-17 09:14:29');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`category_id`);

--
-- Indexes for table `employee`
--
ALTER TABLE `employee`
  ADD PRIMARY KEY (`employee_id`),
  ADD KEY `role_id` (`role_id`);

--
-- Indexes for table `getting_table`
--
ALTER TABLE `getting_table`
  ADD PRIMARY KEY (`getting_table_id`),
  ADD KEY `reservation_id` (`reservation_id`),
  ADD KEY `employee_id` (`employee_id`),
  ADD KEY `package_id` (`package_id`),
  ADD KEY `walkin_id` (`walkin_id`),
  ADD KEY `promotion_id` (`promotion_id`);

--
-- Indexes for table `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`member_id`);

--
-- Indexes for table `menu`
--
ALTER TABLE `menu`
  ADD PRIMARY KEY (`menu_id`),
  ADD KEY `raw_material_id` (`raw_material_id`);

--
-- Indexes for table `notification`
--
ALTER TABLE `notification`
  ADD PRIMARY KEY (`Notification`);

--
-- Indexes for table `notification_order`
--
ALTER TABLE `notification_order`
  ADD PRIMARY KEY (`notifine_order_id`);

--
-- Indexes for table `order`
--
ALTER TABLE `order`
  ADD PRIMARY KEY (`order_id`),
  ADD KEY `select_menu_id` (`select_menu_id`);

--
-- Indexes for table `package`
--
ALTER TABLE `package`
  ADD PRIMARY KEY (`package_id`);

--
-- Indexes for table `package_item`
--
ALTER TABLE `package_item`
  ADD PRIMARY KEY (`package_item_id`),
  ADD KEY `package_id` (`package_id`),
  ADD KEY `menu_item_id` (`menu_id`),
  ADD KEY `raw_material_id` (`menu_id`),
  ADD KEY `menu_id` (`menu_id`);

--
-- Indexes for table `payment`
--
ALTER TABLE `payment`
  ADD PRIMARY KEY (`payment_id`),
  ADD KEY `fk_getting_table` (`getting_table_id`),
  ADD KEY `promotion_id` (`promotion_id`);

--
-- Indexes for table `payment_verificatio`
--
ALTER TABLE `payment_verificatio`
  ADD PRIMARY KEY (`payment_verification_id`),
  ADD KEY `payment_id` (`payment_id`);

--
-- Indexes for table `promotion`
--
ALTER TABLE `promotion`
  ADD PRIMARY KEY (`promotion_id`);

--
-- Indexes for table `promotion_item`
--
ALTER TABLE `promotion_item`
  ADD PRIMARY KEY (`promotion_item_id`),
  ADD KEY `promotion_id` (`promotion_id`),
  ADD KEY `inventory_id` (`inventory_id`);

--
-- Indexes for table `raw_material`
--
ALTER TABLE `raw_material`
  ADD PRIMARY KEY (`raw_material_id`),
  ADD KEY `category_id` (`category_id`),
  ADD KEY `warehouse_id` (`warehouse_id`);

--
-- Indexes for table `receipt`
--
ALTER TABLE `receipt`
  ADD PRIMARY KEY (`receipt_id`),
  ADD KEY `payment_verification_id` (`payment_verification_id`),
  ADD KEY `employee_id` (`employee_id`);

--
-- Indexes for table `reservation`
--
ALTER TABLE `reservation`
  ADD PRIMARY KEY (`reservation_id`),
  ADD KEY `availability_id` (`availability_id`);

--
-- Indexes for table `review`
--
ALTER TABLE `review`
  ADD PRIMARY KEY (`review_id`),
  ADD KEY `receipt_id` (`receipt_id`),
  ADD KEY `tag_id` (`tag_food_id`),
  ADD KEY `tag_clean` (`tag_clean_id`),
  ADD KEY `tag_price` (`tag_price_id`),
  ADD KEY `tag_service` (`tag_service_id`),
  ADD KEY `tag_other_id` (`tag_other_id`);

--
-- Indexes for table `role`
--
ALTER TABLE `role`
  ADD PRIMARY KEY (`role_id`);

--
-- Indexes for table `selecting_item`
--
ALTER TABLE `selecting_item`
  ADD PRIMARY KEY (`selecting_item_id`),
  ADD KEY `getting_table_id` (`getting_table_id`);

--
-- Indexes for table `supplier`
--
ALTER TABLE `supplier`
  ADD PRIMARY KEY (`supplier_id`),
  ADD KEY `catagory_id` (`catagory_id`);

--
-- Indexes for table `table`
--
ALTER TABLE `table`
  ADD PRIMARY KEY (`table_id`),
  ADD KEY `table_type_id` (`table_type_id`);

--
-- Indexes for table `table_availability`
--
ALTER TABLE `table_availability`
  ADD PRIMARY KEY (`availability_id`),
  ADD KEY `table_id` (`table_id`),
  ADD KEY `time_id` (`time_id`);

--
-- Indexes for table `table_type`
--
ALTER TABLE `table_type`
  ADD PRIMARY KEY (`table_type_id`);

--
-- Indexes for table `tag_clean`
--
ALTER TABLE `tag_clean`
  ADD PRIMARY KEY (`tag_clean_id`);

--
-- Indexes for table `tag_food`
--
ALTER TABLE `tag_food`
  ADD PRIMARY KEY (`tag_food_id`);

--
-- Indexes for table `tag_other`
--
ALTER TABLE `tag_other`
  ADD PRIMARY KEY (`tag_other_id`);

--
-- Indexes for table `tag_price`
--
ALTER TABLE `tag_price`
  ADD PRIMARY KEY (`tag_price_id`);

--
-- Indexes for table `tag_service`
--
ALTER TABLE `tag_service`
  ADD PRIMARY KEY (`tag_service_id`);

--
-- Indexes for table `time_reserversion`
--
ALTER TABLE `time_reserversion`
  ADD PRIMARY KEY (`time_id`);

--
-- Indexes for table `walkin`
--
ALTER TABLE `walkin`
  ADD PRIMARY KEY (`walkin_id`),
  ADD KEY `availability_id` (`availability_id`),
  ADD KEY `package_id` (`package_id`),
  ADD KEY `promotion_id` (`promotion_id`);

--
-- Indexes for table `warehouse`
--
ALTER TABLE `warehouse`
  ADD PRIMARY KEY (`warehouse_id`),
  ADD KEY `supplier_id` (`supplier_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `employee`
--
ALTER TABLE `employee`
  MODIFY `employee_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `getting_table`
--
ALTER TABLE `getting_table`
  MODIFY `getting_table_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=811640;

--
-- AUTO_INCREMENT for table `notification`
--
ALTER TABLE `notification`
  MODIFY `Notification` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `notification_order`
--
ALTER TABLE `notification_order`
  MODIFY `notifine_order_id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `order`
--
ALTER TABLE `order`
  MODIFY `order_id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `payment`
--
ALTER TABLE `payment`
  MODIFY `payment_id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `payment_verificatio`
--
ALTER TABLE `payment_verificatio`
  MODIFY `payment_verification_id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `promotion`
--
ALTER TABLE `promotion`
  MODIFY `promotion_id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `raw_material`
--
ALTER TABLE `raw_material`
  MODIFY `raw_material_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=82;

--
-- AUTO_INCREMENT for table `receipt`
--
ALTER TABLE `receipt`
  MODIFY `receipt_id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `reservation`
--
ALTER TABLE `reservation`
  MODIFY `reservation_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=981785;

--
-- AUTO_INCREMENT for table `review`
--
ALTER TABLE `review`
  MODIFY `review_id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `selecting_item`
--
ALTER TABLE `selecting_item`
  MODIFY `selecting_item_id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `table_availability`
--
ALTER TABLE `table_availability`
  MODIFY `availability_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2025;

--
-- AUTO_INCREMENT for table `walkin`
--
ALTER TABLE `walkin`
  MODIFY `walkin_id` int NOT NULL AUTO_INCREMENT;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `employee`
--
ALTER TABLE `employee`
  ADD CONSTRAINT `fk_role_id` FOREIGN KEY (`role_id`) REFERENCES `role` (`role_id`);

--
-- Constraints for table `getting_table`
--
ALTER TABLE `getting_table`
  ADD CONSTRAINT `fk_employee` FOREIGN KEY (`employee_id`) REFERENCES `employee` (`employee_id`),
  ADD CONSTRAINT `fk_package_pppp` FOREIGN KEY (`package_id`) REFERENCES `package` (`package_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_promotion` FOREIGN KEY (`promotion_id`) REFERENCES `promotion` (`promotion_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_reservation` FOREIGN KEY (`reservation_id`) REFERENCES `reservation` (`reservation_id`);

--
-- Constraints for table `menu`
--
ALTER TABLE `menu`
  ADD CONSTRAINT `fk_raw_materia` FOREIGN KEY (`raw_material_id`) REFERENCES `raw_material` (`raw_material_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `order`
--
ALTER TABLE `order`
  ADD CONSTRAINT `fk_select_item` FOREIGN KEY (`select_menu_id`) REFERENCES `selecting_item` (`selecting_item_id`);

--
-- Constraints for table `payment`
--
ALTER TABLE `payment`
  ADD CONSTRAINT `fk_getting_table` FOREIGN KEY (`getting_table_id`) REFERENCES `getting_table` (`getting_table_id`),
  ADD CONSTRAINT `fk_pro` FOREIGN KEY (`promotion_id`) REFERENCES `promotion` (`promotion_id`);

--
-- Constraints for table `payment_verificatio`
--
ALTER TABLE `payment_verificatio`
  ADD CONSTRAINT `fk_payment` FOREIGN KEY (`payment_id`) REFERENCES `payment` (`payment_id`);

--
-- Constraints for table `promotion_item`
--
ALTER TABLE `promotion_item`
  ADD CONSTRAINT `fk_promotion_I` FOREIGN KEY (`promotion_id`) REFERENCES `promotion` (`promotion_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `raw_material`
--
ALTER TABLE `raw_material`
  ADD CONSTRAINT `fk_category` FOREIGN KEY (`category_id`) REFERENCES `category` (`category_id`),
  ADD CONSTRAINT `fk_warehouse` FOREIGN KEY (`warehouse_id`) REFERENCES `warehouse` (`warehouse_id`);

--
-- Constraints for table `receipt`
--
ALTER TABLE `receipt`
  ADD CONSTRAINT `fk_payment_verification` FOREIGN KEY (`payment_verification_id`) REFERENCES `payment_verificatio` (`payment_verification_id`);

--
-- Constraints for table `reservation`
--
ALTER TABLE `reservation`
  ADD CONSTRAINT `fk_table_availability` FOREIGN KEY (`availability_id`) REFERENCES `table_availability` (`availability_id`);

--
-- Constraints for table `review`
--
ALTER TABLE `review`
  ADD CONSTRAINT `fk_receipt` FOREIGN KEY (`receipt_id`) REFERENCES `receipt` (`receipt_id`),
  ADD CONSTRAINT `fk_tag_clean` FOREIGN KEY (`tag_clean_id`) REFERENCES `tag_clean` (`tag_clean_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_tag_food` FOREIGN KEY (`tag_food_id`) REFERENCES `tag_food` (`tag_food_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_tag_other` FOREIGN KEY (`tag_other_id`) REFERENCES `tag_other` (`tag_other_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_tag_price` FOREIGN KEY (`tag_price_id`) REFERENCES `tag_price` (`tag_price_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_tag_service` FOREIGN KEY (`tag_service_id`) REFERENCES `tag_service` (`tag_service_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `supplier`
--
ALTER TABLE `supplier`
  ADD CONSTRAINT `fk_catagory` FOREIGN KEY (`catagory_id`) REFERENCES `category` (`category_id`);

--
-- Constraints for table `table`
--
ALTER TABLE `table`
  ADD CONSTRAINT `fk_table_type_id` FOREIGN KEY (`table_type_id`) REFERENCES `table_type` (`table_type_id`);

--
-- Constraints for table `table_availability`
--
ALTER TABLE `table_availability`
  ADD CONSTRAINT `fk_table_id` FOREIGN KEY (`table_id`) REFERENCES `table` (`table_id`);

--
-- Constraints for table `walkin`
--
ALTER TABLE `walkin`
  ADD CONSTRAINT `fk_package_W` FOREIGN KEY (`package_id`) REFERENCES `package` (`package_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_promotion_W` FOREIGN KEY (`promotion_id`) REFERENCES `promotion_item` (`promotion_item_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_table_W` FOREIGN KEY (`availability_id`) REFERENCES `table_availability` (`availability_id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
